DataProcessors/бит_ЗаполнениеРеквизитовОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнениеРеквизитовОбъектовМетаданных</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУлиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыСчетчиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСчетчика</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыСчетчиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыСчетчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ЗаполнениеРеквизитовОбъектовМетаданных/Forms/Форма/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мСтруктураИсключений; // Структура исключений для реквизитов соответствующих справочников, не предназначенных для непосредственного редактирования.

&НаКлиенте
Перем мИмяРеквизита; // Имя реквизита для гурупповой записи.

&НаКлиенте
Перем мКэшНомерСтраницы; // Кэширует номер страници.

&НаСервере
Перем мСтруктураРеквизитов; // Структуру реквизитов справочников для загрузки.

&НаСервере
Перем Колонки; // Структура колонок загружаемых реквизитов, с описанием их свойств.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимЗаполнения = 0;
	НомерСтраницы = 1;
	ПерваяСтрокаДанных = 2;
	
	// Добавляем условное оформление для модифицированных элементов справочника.
	ЭлементУО			= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента 		= ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных("РеквизитыОбъектаМетаданных");
	
	ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "РеквизитыОбъектаМетаданных.ЭлтИзменен", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);
	
	Элементы.ГруппаСтраницаОтбораЛС.Видимость		   = Ложь;
	Элементы.ГруппаСтраницаОтбораТипВид.Видимость	   = Ложь;
	Элементы.ГруппаСтраницаТабличныйДокумент.Видимость = Ложь;
	Элементы.ГруппаСтраницаНастройка.Видимость		   = Ложь;
	Элементы.ФайлЧтения.Видимость					   = Ложь;
	Элементы.Загрузить.Видимость					   = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаСправочника(Элт)
	
	ТекДанные = Элементы.РеквизитыОбъектаМетаданных.ТекущиеДанные;
	ТекДанные.ЭлтИзменен = Истина;
	Модифицированность = Истина;
	Элементы.ФормаЗаписать.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки(ИмяСправочника)
	
	ТЗНастроек = РеквизитФормыВЗначение("ТаблицаЗагружаемыхРеквизитов");
	ЗаполнитьНастройкиСервер(ИмяСправочника, ТЗНастроек, мСтруктураРеквизитов);
	ЗначениеВРеквизитФормы(ТЗНастроек, "ТаблицаЗагружаемыхРеквизитов");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНастройкиСервер(ИмяСправочника, ТЗНастроек, мСтруктураРеквизитов)
	
	Если ИмяСправочника = "бит_ЛицевыеСчетаКР" Тогда
		МетаданныеИсточника = Справочники.бит_ЛицевыеСчета.ПолучитьСсылку().Метаданные();
	Иначе
		МетаданныеИсточника = Справочники[ИмяСправочника].ПолучитьСсылку().Метаданные();
	КонецЕсли;
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСправочника = "бит_Квартиры" Тогда
		
		ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "ЛС";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12));
		
		ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "ЕЛСГИСЖКХ";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "ЕЛС ГИС ЖКХ";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10));
		
	ИначеЕсли  ИмяСправочника = "бит_Счетчики" Тогда
		ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "ЗаводскойСерийныйНомерПУ";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Заводской (серийный) номер ПУ";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
		
		Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
			
			ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
			
		КонецЕсли;

		
	ИначеЕсли  ИмяСправочника = "бит_ПлатежныеДокументыГИСЖКХ" Тогда
		ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "НомерПД";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Номер ПД";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30));
		
	Иначе
		
		Если МетаданныеИсточника.ДлинаКода > 0 Тогда
			
			ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = "Код";
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Код";
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
			
			Если МетаданныеИсточника.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
				ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаКода));
			Иначе
				ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(МетаданныеИсточника.ДлинаКода));
			КонецЕсли;
			
		КонецЕсли;
		
		Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
			
			ЗагружаемыйРеквизит = ТЗНастроек.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
			
		КонецЕсли;

	КонецЕсли;
	
	Исключения = Новый Структура;
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		Если НЕ Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы 
			И (мСтруктураРеквизитов.Свойство(ИмяСправочника, Исключения) И Исключения.Свойство(Реквизит.Имя)) Тогда
			
			ЗагружаемыйРеквизит                        = ТЗНастроек.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = НЕ Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЗагружаемыйРеквизит Из ТЗНастроек Цикл
		ЗагружаемыйРеквизит.ОписаниеТипов = ЗагружаемыйРеквизит.ДоступноеОписаниеТипов;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СправочникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение)
		И ВыбранноеЗначение <> Справочник Тогда
		
		ЗаполинтьТаблицуДоступныхРеквизитов(ВыбранноеЗначение);
		
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница			= Элементы.ГруппаСтраницаРеквизитов;
	Элементы.ГруппаСтраницаОтбораЛС.Видимость		= ?(ВыбранноеЗначение = "бит_ЛицевыеСчета" ИЛИ ВыбранноеЗначение = "бит_ЛицевыеСчетаКР" ИЛИ ВыбранноеЗначение = "бит_Проживающие" ИЛИ ВыбранноеЗначение = "бит_ПлатежныеДокументыГИСЖКХ", Истина, Ложь);
	Элементы.ГруппаСтраницаОтбораТипВид.Видимость	= ?(ВыбранноеЗначение = "бит_Счетчики", 	  Истина, Ложь);
	Элементы.ГруппаСтраницаОтбораЗданий.Видимость	= ?(ВыбранноеЗначение = "бит_Счетчики", 	  Ложь,   Истина);
	Элементы.ГруппаСтраницаОтбораУлиц.Видимость		= ?(ВыбранноеЗначение = "бит_Счетчики",	  Ложь,	  Истина);
	
	Если РежимЗаполнения = 1
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			ТаблицаЗагружаемыхРеквизитов.Очистить();
			ЗаполнитьНастройки(ВыбранноеЗначение);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗаполненияПриИзменении(Элемент)
	
	Если РежимЗаполнения = 0 Тогда
		Элементы.ФормаРедактироватьСправочник.Видимость	   = Истина;
		Элементы.ФормаЗаписать.Видимость				   = Истина;
		Элементы.Загрузить.Видимость					   = Ложь;
		Элементы.ФормаЗаписать.КнопкаПоУмолчанию		   = Истина;
		Элементы.Загрузить.КнопкаПоУмолчанию			   = Ложь;
		Элементы.ГруппаСтраницаРеквизитов.Видимость		   = Истина;
		Элементы.ГруппаСтраницаСправочников.Видимость	   = Истина;
		Элементы.ГруппаСтраницаОтборов.Видимость		   = Истина;
		Элементы.ГруппаСтраницаТабличныйДокумент.Видимость = Ложь;
		Элементы.ГруппаСтраницаНастройка.Видимость		   = Ложь;
		Элементы.УстановленныеОтборы.Видимость			   = Истина;
		Элементы.ФайлЧтения.Видимость					   = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница			   = Элементы.ГруппаСтраницаРеквизитов;
		
		Элементы.Справочник.СписокВыбора.Очистить();
		Элементы.Справочник.СписокВыбора.Добавить("бит_ЛицевыеСчета"			, "Лицевые счета");
		Элементы.Справочник.СписокВыбора.Добавить("бит_СписокЗданий"			, "Список зданий");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Квартиры"				, "Квартиры");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Комнаты"					, "Комнаты");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Подъезды"				, "Подъезды");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Счетчики"				, "Счетчики");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Проживающие"				, "Проживающие");
		Элементы.Справочник.СписокВыбора.Добавить("бит_ПлатежныеДокументыГИСЖКХ", "Платежные документы ГИС ЖКХ");
		
		Если Справочник = "бит_ЛицевыеСчетаКР"Тогда
			Справочник = "бит_ЛицевыеСчета";
		КонецЕсли;
		
	Иначе	
		Элементы.ФормаРедактироватьСправочник.Видимость	   = Ложь;
		Элементы.ФормаЗаписать.Видимость				   = Ложь;
		Элементы.Загрузить.Видимость					   = Истина;
		Элементы.ФормаЗаписать.КнопкаПоУмолчанию		   = Ложь;
		Элементы.Загрузить.КнопкаПоУмолчанию			   = Истина;
		Элементы.ГруппаСтраницаРеквизитов.Видимость		   = Ложь;
		Элементы.ГруппаСтраницаСправочников.Видимость	   = Ложь;
		Элементы.ГруппаСтраницаОтборов.Видимость		   = Ложь;
		Элементы.ГруппаСтраницаТабличныйДокумент.Видимость = Истина;
		Элементы.ГруппаСтраницаНастройка.Видимость		   = Истина;
		Элементы.УстановленныеОтборы.Видимость			   = Ложь;
		Элементы.ФайлЧтения.Видимость					   = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница			   = Элементы.ГруппаСтраницаТабличныйДокумент;
		
		Элементы.Справочник.СписокВыбора.Очистить();
		Элементы.Справочник.СписокВыбора.Добавить("бит_ЛицевыеСчета"			, "Лицевые счета");
		Элементы.Справочник.СписокВыбора.Добавить("бит_ЛицевыеСчетаКР"			, "Лицевые счета (кап. рем.)");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Квартиры"				, "Квартиры");
		Элементы.Справочник.СписокВыбора.Добавить("бит_Счетчики"				, "Счетчики");
		Элементы.Справочник.СписокВыбора.Добавить("бит_ПлатежныеДокументыГИСЖКХ", "Платежные документы ГИС ЖКХ");
		
		Если ЗначениеЗаполнено(Справочник) Тогда
			ТаблицаЗагружаемыхРеквизитов.Очистить();
			ЗаполнитьНастройки(Справочник);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РеквизитыОбъектаМетаданныхСсылка" Тогда
		СтандартнаяОбработка = Ложь;
		Если НЕ Элемент.ТекущиеДанные = Неопределено  
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
			
			Попытка
				Парам = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка);
				ОткрытьФорму("Справочник." + Справочник + ".ФормаОбъекта", Парам);
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛицевыхСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ элт = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокЛицевыхСчетов.Добавить();
		НоваяСтрока.ЛицевойСчет = Элт;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокУлицОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ Элт = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокУлиц.Добавить();
		НоваяСтрока.Улица = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ Элт = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокЗданий.Добавить();
		НоваяСтрока.Здание = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСтраницыПриИзменении(Элемент)
	
	Если НомерСтраницы = 0 Тогда
		НомерСтраницы = 1;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФайлЧтения) Тогда
		ТекстСообщения = НСтр("ru = 'Файл загрузки не выбран!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	ФайлНаДиске = Новый Файл(ФайлЧтения);
	Если нРег(ФайлНаДиске.Расширение) = ".xls"
		ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
		ПрочитатьТабличныйДокументИзExcel(ТабДок, ФайлЧтения, НомерСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовОписаниеТиповНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	
	Описание = ТекущиеДанные.ДоступноеОписаниеТипов;
	МассивТипов = Новый Массив;
	Для Каждого Тип Из Описание.Типы() Цикл
		МассивТипов.Добавить(Тип);
	КонецЦикла;
	
	Элемент.ДоступныеТипы = Новый ОписаниеТипов(МассивТипов, Описание.КвалификаторыЧисла, Описание.КвалификаторыСтроки, Описание.КвалификаторыДаты);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовОписаниеТиповОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	ТекущиеДанные.ОписаниеТипов = ТекущиеДанные.ДоступноеОписаниеТипов;
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьЭлементыСправочника(Команда)
	
	ОтобразитьТекущиеОтборы();
	
	Если РеквизитыОбъектаМетаданных.Количество() > 0
		И РеквизитыОбъектаМетаданных.НайтиСтроки(Новый Структура("ЭлтИзменен", Истина)).Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПолучитьЭлементыСправочникаЗавершение", ЭтотОбъект)
												, "Все изменения, на закладке 'Справочник', будут потеряны. Продолжить?"
												, РежимДиалогаВопрос.ДаНет); 
		Возврат;						
	КонецЕсли;
	
	// Проверка настроек.
	ИспользуемыРекты = Объект.ДоступныеРеквизиты.НайтиСтроки(Новый Структура ("Использовать", Истина));
	Если ИспользуемыРекты.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выберите реквизиты справочника для редактирования!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРеквизитов;
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочник) Тогда
		ЗаполнитьРеквизитыОбъектаМетаданныхСервер();
	КонецЕсли;
	
	Элементы.ГруппаСтраницаСправочников.Заголовок = "Справочник """ + Элементы.Справочник.ТекстРедактирования + """";
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаСправочников;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЭлементыСправочникаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ЗначениеЗаполнено(Справочник) Тогда
			ЗаполнитьРеквизитыОбъектаМетаданныхСервер();
		КонецЕсли;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаСправочников;
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура Записать(Команда)
	
	МассивЭлементовДляЗаписи = РеквизитыОбъектаМетаданных.НайтиСтроки(Новый Структура("ЭлтИзменен", Истина));
	
	Если НЕ МассивЭлементовДляЗаписи.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствуют изменения для записи.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьЗавершение", ЭтотОбъект)
											, "Записать изменения?"
											, РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОшибкиЗаписи = "";
		ЗаписатьНаСервере(ОшибкиЗаписи);
		Если НЕ ПустаяСтрока(ОшибкиЗаписи) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1'"), ОшибкиЗаписи);
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборЗданий(Команда)
	
	Объект.СписокЗданий.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборУлиц(Команда)
	
	Объект.СписокУлиц.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеРеквизиты(Команда)
	
	ИзменитьОтметкуРеквизитовСправочника(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметкиРеквизитов(Команда)
	
	ИзменитьОтметкуРеквизитовСправочника(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДляВыбранных(Команда)
	
	ОтменитьДляВыбранныхСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьДляВыбранных(Команда)
	
    // Нестабильный функционал.
	Реквизит = Элементы.РеквизитыОбъектаМетаданных.ТекущийЭлемент;
	ИмяРеквизита = Реквизит.Имя;
	Если ЗначениеЗаполнено(ИмяРеквизита)
		И НЕ Реквизит.ТолькоПросмотр Тогда
		ВыбЗнач = Неопределено;
		мИмяРеквизита = СтрЗаменить(ИмяРеквизита,"РеквизитыОбъектаМетаданных",""); // Удаляем лишнее.
		ТекДанные = Элементы.РеквизитыОбъектаМетаданных.ТекущиеДанные;
		ТипТекЗначения = ТипЗнч(ТекДанные[мИмяРеквизита]);
		ОписаниеОповещения = Новый ОписаниеОповещения("УказатьДляВыбранныхЗавершение", ЭтотОбъект, Элементы.РеквизитыОбъектаМетаданных.ВыделенныеСтроки);
		
		НазваниеРеквизита = ПолучитьЗаголовок(мИмяРеквизита, Объект.ДоступныеРеквизиты);
		ПоказатьВводЗначения(ОписаниеОповещения, ВыбЗнач, "Введите значение '" + НазваниеРеквизита + "':", ТипТекЗначения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьДляВыбранныхЗавершение(ВыбЗнач, Параметры) Экспорт
	
	Для Каждого Элт Из Параметры Цикл
		Стр = РеквизитыОбъектаМетаданных.НайтиПоИдентификатору(Элт);
		Если Стр = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		Стр[мИмяРеквизита] = ВыбЗнач; 
		Стр.ЭлтИзменен = Истина
	КонецЦикла;
	
	Модифицированность = Истина;
	Элементы.ФормаЗаписать.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборЛС(Команда)
	
	Объект.СписокЛицевыхСчетов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛС(Команда)
	
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина, Ложь);
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЛицевыхСчетов, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗданий(Команда)
	
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина, Ложь);
	ОткрытьФорму("Справочник.бит_СписокЗданий.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЗданий, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУлиц(Команда)
	
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина, Ложь);
	ОткрытьФорму("Справочник.бит_СписокУлиц.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокУлиц, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ВыделенныеСтроки = Новый ФиксированныйМассив(Элементы.РеквизитыОбъектаМетаданных.ВыделенныеСтроки); // Фиксируем массив.
	Для Каждого Стр Из ВыделенныеСтроки Цикл
		Попытка
			Элт = РеквизитыОбъектаМетаданных.НайтиПоИдентификатору(Стр);
			РеквизитыОбъектаМетаданных.Удалить(Элт);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборВидСчетчика(Команда)
	
	Объект.ВидыСчетчиков.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборТипСчетчика(Команда)
	
	Объект.ТипыСчетчиков.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Табличный документ (*.xlsx;*.xls)|*.xlsx;*.xls";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Если нРег(ФайлНаДиске.Расширение) = ".xls"
			ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
			ПрочитатьТабличныйДокументИзExcel(ТабДок, ДиалогВыбораФайла.ПолноеИмяФайла, НомерСтраницы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФайл(Команда)
	
	Если НомерСтраницы = 0 Тогда
		НомерСтраницы = 1;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФайлЧтения) Тогда
		ТекстСообщения = НСтр("ru = 'Файл загрузки не выбран!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	ФайлНаДиске = Новый Файл(ФайлЧтения);
	Если нРег(ФайлНаДиске.Расширение) = ".xls"
		ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx" Тогда
		ПрочитатьТабличныйДокументИзExcel(ТабДок, ФайлЧтения, НомерСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Индикатор = 0;
	Состояние("Загрузка данных в справочник '" + Справочник + "'...");
	
	Если НЕ ЗначениеЗаполнено(Справочник) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать справочник для заполнения и выполнить настройку.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФайлЧтения) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран файл для загрузки данных в справочник.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Если ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("Пометка, РежимЗагрузки", Истина, Истина)).Количество() > 0 Тогда 
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект)
						, "Будет выполнена попытка загрузки данных в справочник """ + Элементы.Справочник.ВыделенныйТекст + """. Продолжить?"
						, РежимДиалогаВопрос.ДаНет); 
	Иначе
		ТекстСообщения = НСтр("ru = 'Необходимо выполнить настройку для загрузки данных.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ОшибкиЗаписи = "";
		ЗагрузитьНаСервере(ОшибкиЗаписи);
		Если НЕ ПустаяСтрока(ОшибкиЗаписи) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1'"), ОшибкиЗаписи);
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗначениеИндикатораЗагрузки" Тогда
		Индикатор = ПолучитьИзВременногоХранилища(Параметр);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура отображает текущие отборы.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ОтобразитьТекущиеОтборы()
	
	УстановленныеОтборы = "";
	
	Если Объект.СписокУлиц.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Улицы";
	КонецЕсли;
	
	Если Объект.СписокЗданий.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Здания";
	КонецЕсли;
	
	Если Объект.СписокЛицевыхСчетов.Количество() > 0 Тогда
		Запятая = ?(НЕ УстановленныеОтборы = "", ", ","");
		УстановленныеОтборы = УстановленныеОтборы + Запятая + "Лицевые счета";
	КонецЕсли;
	
	Если УстановленныеОтборы = "" Тогда
		УстановленныеОтборы = "Отбор не установлен.";
	Иначе
		УстановленныеОтборы = УстановленныеОтборы + ".";
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРеквизитыОбъектаМетаданныхСервер()
    
    ТЗ_Реквизиты = РеквизитФормыВЗначение("РеквизитыОбъектаМетаданных");
    
    МассивРеквизитов = Новый Массив;
    
    // Удалим ранее созданные колонки в РеквизитыОбъектаМетаданных.    
    Для Каждого Колонка Из ТЗ_Реквизиты.Колонки Цикл
        МассивРеквизитов.Добавить("РеквизитыОбъектаМетаданных." + Колонка.Имя);        
    КонецЦикла;
    ИзменитьРеквизиты(,МассивРеквизитов);
    
    // Удалим отображение таблицы на форме и создадим новую.
    ЭлементТаблица = Элементы.Найти("РеквизитыОбъектаМетаданных");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);        
    КонецЕсли;     
    
	ЭлементТаблица = Элементы.Добавить("РеквизитыОбъектаМетаданных", Тип("ТаблицаФормы"), Элементы.ГруппаСтраницаСправочников);
	ЭлементТаблица.ПутьКДанным = "РеквизитыОбъектаМетаданных";
	ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
    
    // Выполним запрос.
	ТЗ_Реквизиты = ПолучитьРеквизитыОбъектаМетаданных();
	
	Если ТЗ_Реквизиты = Неопределено Тогда
		Возврат;	
	КонецЕсли;
    
    // Создадим реквизиты РеквизитыОбъектаМетаданных.
    МассивРеквизитов.Очистить();
	Для Каждого Колонка ИЗ ТЗ_Реквизиты.Колонки Цикл
        НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,,"Null"), "РеквизитыОбъектаМетаданных", ПолучитьЗаголовок(Колонка.Имя, Объект.ДоступныеРеквизиты));
        МассивРеквизитов.Добавить(НоваяКолонка);
    КонецЦикла;      
    ИзменитьРеквизиты(МассивРеквизитов);  
    ЗначениеВРеквизитФормы(ТЗ_Реквизиты, "РеквизитыОбъектаМетаданных");
    
    // Создаем элементы на форме для отображения колонок.
    ЭлементРеквизитыОбъектаМетаданных = Элементы.РеквизитыОбъектаМетаданных;
	
	Для Каждого Колонка ИЗ ТЗ_Реквизиты.Колонки Цикл
		
		Если Колонка.Имя = "Улица"
			ИЛИ Колонка.Имя = "НомерДома"
			ИЛИ Колонка.Имя = "ПрефиксДома"
			ИЛИ Колонка.Имя = "Корпус"
			ИЛИ Колонка.Имя = "Район"
			ИЛИ Колонка.Имя = "Квартира" Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементФормы = Элементы.Добавить("РеквизитыОбъектаМетаданных"+Колонка.Имя, Тип("ПолеФормы"), ЭлементРеквизитыОбъектаМетаданных);
		
        НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлементФормы.ПутьКДанным = "РеквизитыОбъектаМетаданных." + Колонка.Имя;
		НовыйЭлементФормы.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		
		// Скрываем служебные колонки, добовляем событие для отметки изменений.
		Если Колонка.Имя = "ЭлтИзменен" Тогда
			НовыйЭлементФормы.Видимость = Ложь;
			
		ИначеЕсли Колонка.Имя = "Ссылка"
			ИЛИ Колонка.Имя = "ЛС_Физ_лица"
			ИЛИ Колонка.Имя = "Здание_Физ_лица"
			ИЛИ Колонка.Имя = "Улица_Физ_лица"
			ИЛИ Колонка.Имя = "Адрес"
			ИЛИ Колонка.Имя = "Улица"
			ИЛИ Колонка.Имя = "НомерДома"
			ИЛИ Колонка.Имя = "ПрефиксДома"
			ИЛИ Колонка.Имя = "Корпус"
			ИЛИ Колонка.Имя = "Район"
			ИЛИ Колонка.Имя = "Квартира" Тогда
			НовыйЭлементФормы.ТолькоПросмотр = Истина;
		КонецЕсли;
		
    КонецЦикла;
	
	// Скрываем команды.
	ЭлементРеквизитыОбъектаМетаданных.ИзменятьСоставСтрок  = Ложь;
	
	// Добавляем команды.
	КнопкаПеречитатьВыделенныеЭлементы = Элементы.Добавить("ОтменитьДляВыбранных", Тип("КнопкаФормы"), ЭлементРеквизитыОбъектаМетаданных.КоманднаяПанель);
	КнопкаПеречитатьВыделенныеЭлементы.ИмяКоманды = "ОтменитьДляВыбранных";
	
	КнопкаПеречитатьВыделенныеЭлементы = Элементы.Добавить("УказатьДляВыбранных", Тип("КнопкаФормы"), ЭлементРеквизитыОбъектаМетаданных.КоманднаяПанель);
	КнопкаПеречитатьВыделенныеЭлементы.ИмяКоманды = "УказатьДляВыбранных";
	
	КнопкаПеречитатьВыделенныеЭлементы = Элементы.Добавить("Удалить", Тип("КнопкаФормы"), ЭлементРеквизитыОбъектаМетаданных.КоманднаяПанель);
	КнопкаПеречитатьВыделенныеЭлементы.ИмяКоманды = "Удалить";
	
	КнопкаПеречитатьВыделенныеЭлементы = Элементы.Добавить("УдалитьСтроки", Тип("КнопкаФормы"), ЭлементРеквизитыОбъектаМетаданных.КонтекстноеМеню);
	КнопкаПеречитатьВыделенныеЭлементы.Заголовок = "Удалить";
	КнопкаПеречитатьВыделенныеЭлементы.ИмяКоманды = "Удалить";

	// Задаем имя универсальной процедуры, для отметки факта модификации эл-та.
	УстановитьСобытиеИзмененияСервер();
	
	Модифицированность = Ложь;
	
	// После обновления блокируем команду записи, до модификации вновь полученных элементов справочника пользователем.
	Элементы.ФормаЗаписать.Доступность = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаголовок(ИмяКолонка, Знач ТЗ)
	
	ЗаголовокКолнки = "";
	
	Если ИмяКолонка = "Ссылка" Тогда
		Возврат ЗаголовокКолнки;
	КонецЕсли;
	
	МассивИмен = ТЗ.НайтиСтроки( Новый Структура("ИмяРеквизита",ИмяКолонка));
	Если МассивИмен.Количество() > 0  Тогда
		ЗаголовокКолнки = МассивИмен[0].Синоним;	
	КонецЕсли;
	
	Возврат ЗаголовокКолнки;
	
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыОбъектаМетаданных(СписокЭлтов = Неопределено)
	
	ИменаРеквизитов = "";
	Для Каждого Стр Из Объект.ДоступныеРеквизиты Цикл
		Если НЕ Стр.Использовать Тогда
			Продолжить;
		КонецЕсли;
		ИменаРеквизитов = ИменаРеквизитов + Стр.ИмяРеквизита + ","
	КонецЦикла;
	
	Если ИменаРеквизитов = "" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если Справочник = "бит_Проживающие" Тогда
		ТекстЗапрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|	ЛОЖЬ КАК ЭлтИзменен
		|ПОМЕСТИТЬ ВТ_Проживающие
		|ИЗ
		|	Справочник.бит_Проживающие КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Проживающие.Ссылка, " + ИменаРеквизитов + "
		|	ВТ_Проживающие.ЭлтИзменен,
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ ВТ_ЛСПроживающих
		|ИЗ
		|	ВТ_Проживающие КАК ВТ_Проживающие
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|				,
		|				ФизЛицо В
		|					(ВЫБРАТЬ
		|						ВТ_Проживающие.Ссылка
		|					ИЗ
		|						ВТ_Проживающие)) КАК бит_ПроживающиеПоЛССрезПоследних
		|		ПО ВТ_Проживающие.Ссылка = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
		|ГДЕ
		|	НЕ бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица = ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛСПроживающих.Ссылка, " + ИменаРеквизитов + "
		|	ВТ_ЛСПроживающих.ЭлтИзменен,
		|	ВТ_ЛСПроживающих.ЛицевойСчет КАК ЛС_Физ_лица,
		|	бит_ЛицевыеСчета.Здание КАК Здание_Физ_лица,
		|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица_Физ_лица
		|ИЗ
		|	ВТ_ЛСПроживающих КАК ВТ_ЛСПроживающих
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО ВТ_ЛСПроживающих.ЛицевойСчет = бит_ЛицевыеСчета.Ссылка
		|ГДЕ
		|	НЕ бит_ЛицевыеСчета.ПометкаУдаления";
	Иначе	
		ТекстЗапрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + " 
		|	ЛОЖЬ КАК ЭлтИзменен
		|
		|ИЗ
		|	Справочник." + Справочник + " КАК Таблица
		|ГДЕ
		|	НЕ Таблица.ПометкаУдаления";
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапрос);
	
	ОтборЗдания		  = Объект.СписокЗданий.Выгрузить(,"Здание").ВыгрузитьКолонку("Здание");
	ОтборУлица		  = Объект.СписокУлиц.Выгрузить(,"Улица").ВыгрузитьКолонку("Улица");
	ОтборЛС			  = Объект.СписокЛицевыхСчетов.Выгрузить(,"ЛицевойСчет").ВыгрузитьКолонку("ЛицевойСчет");
	ОтборТипСчетчиков = Объект.ТипыСчетчиков.Выгрузить(,"ТипСчетчика").ВыгрузитьКолонку("ТипСчетчика");
	ОтборВидСчетчиков = Объект.ВидыСчетчиков.Выгрузить(,"ВидСчетчика").ВыгрузитьКолонку("ВидСчетчика");
	
	// Отбор по ссылкам.
	Если НЕ СписокЭлтов = Неопределено Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("Таблица.Ссылка В (&СписокЭлтов)");
	КонецЕсли;
	
	Если Справочник = "бит_СписокЗданий" Тогда
		ЗапросСхемы		= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбрать = ЗапросСхемы.Операторы[0];
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Улица");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.НомерДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.ПрефиксДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Корпус");
	ИначеЕсли Справочник = "бит_Квартиры" ИЛИ Справочник = "бит_Подъезды" Тогда
		ЗапросСхемы		= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбрать = ЗапросСхемы.Операторы[0];
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Улица");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.НомерДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.ПрефиксДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Корпус");
		
		ЗапросСхемы.Колонки.Найти("ВладелецУлица").Псевдоним	   = "Улица";
		ЗапросСхемы.Колонки.Найти("ВладелецНомерДома").Псевдоним   = "НомерДома";
		ЗапросСхемы.Колонки.Найти("ВладелецПрефиксДома").Псевдоним = "ПрефиксДома";
		ЗапросСхемы.Колонки.Найти("ВладелецКорпус").Псевдоним	   = "Корпус";
	ИначеЕсли Справочник = "бит_Комнаты" Тогда
		ЗапросСхемы		= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбрать = ЗапросСхемы.Операторы[0];
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Владелец.Улица");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Владелец");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Владелец.НомерДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Владелец.ПрефиксДома");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.Владелец.Корпус");
		ОператорВыбрать.ВыбираемыеПоля.Добавить("Таблица.Владелец.НомерКвартиры");
		
		ЗапросСхемы.Колонки.Найти("ВладелецВладелецУлица").Псевдоним	   = "Улица";
		ЗапросСхемы.Колонки.Найти("ВладелецВладелецНомерДома").Псевдоним   = "НомерДома";
		ЗапросСхемы.Колонки.Найти("ВладелецВладелецПрефиксДома").Псевдоним = "ПрефиксДома";
		ЗапросСхемы.Колонки.Найти("ВладелецВладелецКорпус").Псевдоним	   = "Корпус";
		ЗапросСхемы.Колонки.Найти("ВладелецНомерКвартиры").Псевдоним	   = "Квартира";
	ИначеЕсли Справочник = "бит_ПлатежныеДокументыГИСЖКХ" Тогда
		ЗапросСхемы		= СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбрать = ЗапросСхемы.Операторы[0];
		ОператорВыбрать.Отбор.Добавить("НЕ Таблица.ЭтоГруппа");
	КонецЕсли;
	
	// Отбор Здания.
	Если ОтборЗдания.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		
		Если Справочник = "бит_СписокЗданий" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Ссылка В (&Здание)");
		ИначеЕсли Справочник = "бит_Квартиры" ИЛИ Справочник = "бит_Подъезды" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Владелец В (&Здание)");
		ИначеЕсли Справочник = "бит_Комнаты" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Владелец.Владелец В (&Здание)");
		ИначеЕсли Справочник = "бит_ЛицевыеСчета" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Здание В (&Здание)");
		ИначеЕсли Справочник = "бит_Проживающие" Тогда
			ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[2];
			ОператорВыбора = ЗапросСхемы.Операторы[0];
			ОператорВыбора.Отбор.Добавить("бит_ЛицевыеСчета.Здание В (&Здание)");
		ИначеЕсли Справочник = "бит_ПлатежныеДокументыГИСЖКХ" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.ЛицевойСчет.Здание В (&Здание)");
		КонецЕсли;
		
	КонецЕсли;
	
	// Отбор Улицы.
	Если ОтборУлица.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		
		Если Справочник = "бит_СписокЗданий" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Улица В (&Улица)");
		ИначеЕсли Справочник = "бит_Квартиры" ИЛИ Справочник = "бит_Подъезды" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Владелец.Улица В (&Улица)");
		ИначеЕсли Справочник = "бит_Комнаты" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.Владелец.Владелец.Улица В (&Улица)");
		ИначеЕсли Справочник = "бит_ЛицевыеСчета" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.УлицаЛицевогоСчета В (&Улица)");
		ИначеЕсли Справочник = "бит_Проживающие" Тогда
			ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[2];
			ОператорВыбора = ЗапросСхемы.Операторы[0];
			ОператорВыбора.Отбор.Добавить("бит_ЛицевыеСчета.УлицаЛицевогоСчета В (&Улица)");
		ИначеЕсли Справочник = "бит_ПлатежныеДокументыГИСЖКХ" Тогда
			ОператорВыбора.Отбор.Добавить("Таблица.ЛицевойСчет.УлицаЛицевогоСчета В (&Улица)");
		КонецЕсли;
		
	КонецЕсли;
	
	// Отбор ЛС.
	Если Справочник = "бит_ЛицевыеСчета" И ОтборЛС.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("Таблица.Ссылка В (&ЛицевойСчет)");
	ИначеЕсли Справочник = "бит_Проживающие" И ОтборЛС.Количество() > 0 Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет В (&ЛицевойСчет)");
	ИначеЕсли Справочник = "бит_ПлатежныеДокументыГИСЖКХ" И ОтборЛС.Количество() > 0 Тогда 
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[1];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("Таблица.ЛицевойСчет В (&ЛицевойСчет)");
	КонецЕсли;
	
	// Отбор Тип/Вид счетчика.
	Если Справочник = "бит_Счетчики" Тогда
		Если ОтборТипСчетчиков.Количество() > 0 Тогда
			ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
			ОператорВыбора = ЗапросСхемы.Операторы[0];
			ОператорВыбора.Отбор.Добавить("Таблица.ТипСчетчика В (&ТипСчетчика)");
		КонецЕсли;
		
		Если ОтборВидСчетчиков.Количество() > 0 Тогда
			ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
			ОператорВыбора = ЗапросСхемы.Операторы[0];
			ОператорВыбора.Отбор.Добавить("Таблица.ВидСчетчика В (&ВидСчетчика)");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Здание"		, ОтборЗдания);
	Запрос.УстановитьПараметр("Улица"		, ОтборУлица);
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ОтборЛС);
	Запрос.УстановитьПараметр("ТипСчетчика"	, ОтборТипСчетчиков);
	Запрос.УстановитьПараметр("ВидСчетчика"	, ОтборВидСчетчиков);
	
	Если НЕ СписокЭлтов = Неопределено Тогда
		Запрос.УстановитьПараметр("СписокЭлтов", СписокЭлтов);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Заполнение адресного реквизита.
	Если Справочник = "бит_СписокЗданий" Тогда
		
		Результат.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"), "Адрес");
		
		Для Каждого Стр Из Результат Цикл
			Стр.Адрес = Строка(Стр.Улица) + ", д. " + Строка(Стр.НомерДома) + " "	+ Строка(Стр.ПрефиксДома)
						+ ?(ЗначениеЗаполнено(Стр.Корпус),", корп. " + Строка(Стр.Корпус),"");
		КонецЦикла;

	ИначеЕсли Справочник = "бит_Квартиры" ИЛИ Справочник = "бит_Подъезды" Тогда
		
		Результат.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"), "Адрес");
		
		Для Каждого Стр Из Результат Цикл
			Стр.Адрес = Строка(Стр.Улица) + ", д. " + Строка(Стр.НомерДома) + " "	+ Строка(Стр.ПрефиксДома)
						+ ?(ЗначениеЗаполнено(Стр.Корпус),", корп. " + Строка(Стр.Корпус),"")
						+ ?(Справочник = "бит_Квартиры" И ЗначениеЗаполнено(Стр.Ссылка),", кв. " + Строка(Стр.Ссылка),"");
		КонецЦикла;

	ИначеЕсли Справочник = "бит_Комнаты" Тогда
		
		Результат.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"), "Адрес");
		
		Для Каждого Стр Из Результат Цикл
			Стр.Адрес = Строка(Стр.Улица) + ", д. " + Строка(Стр.НомерДома) + " "	+ Строка(Стр.ПрефиксДома)
						+ ?(ЗначениеЗаполнено(Стр.Корпус),", корп. " + Строка(Стр.Корпус),"")
						+ ?(ЗначениеЗаполнено(Стр.Квартира),", кв. " + Строка(Стр.Квартира),"")
						+ ?(Справочник = "бит_Комнаты" И ЗначениеЗаполнено(Стр.Ссылка),", ком. " + Строка(Стр.Ссылка),"");
		КонецЦикла;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьСобытиеИзмененияСервер()
	
	Для Каждого Элт Из Элементы.РеквизитыОбъектаМетаданных.ПодчиненныеЭлементы Цикл
		Если Элт.ТолькоПросмотр Тогда
			Продолжить;
		КонецЕсли;
		Элт.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаСправочника");
	КонецЦикла;
	
	Элементы.РеквизитыОбъектаМетаданных.УстановитьДействие("Выбор", "РеквизитыОбъектаМетаданныхВыбор");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполинтьТаблицуДоступныхРеквизитов(Знач ИмяСправочника)
	
	Объект.ДоступныеРеквизиты.Очистить();
	
	СтруктураРеквизитов = ПолучитьТаблицуДоступныхРеквизитовСервер(ИмяСправочника, мСтруктураИсключений);
	Если СтруктураРеквизитов.Количество() > 0 Тогда
		Для Каждого Элт Из СтруктураРеквизитов Цикл
			НСтр			  = Объект.ДоступныеРеквизиты.Добавить();
			НСтр.ИмяРеквизита = Элт.Ключ;
			НСтр.Синоним	  = Элт.Значение;
			НСтр.Использовать = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуДоступныхРеквизитовСервер(ИмяСправочника, мСтруктураИсключений)
	
	ИмяСправочника = ?(ИмяСправочника = "бит_ЛицевыеСчетаКР", "бит_ЛицевыеСчета", ИмяСправочника);
	Исключения = Новый Структура;
	СтруктураРеквизитов = Новый Структура;
	КолцияРевизитов = Метаданные.Справочники[ИмяСправочника].Реквизиты;
	Для Каждого Элт Из КолцияРевизитов Цикл
		Если СтрНачинаетсяС(НРег(Элт.Имя), "удалить") 
			ИЛИ (мСтруктураИсключений.Свойство(ИмяСправочника, Исключения) И Исключения.Свойство(Элт.Имя)) Тогда 
			
			Продолжить;	// Пропускаем реквизиты выведенные из работы конфигурации.
		КонецЕсли;
		СтруктураРеквизитов.Вставить(Элт.Имя, Элт.Синоним);
	КонецЦикла;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьОтметкуРеквизитовСправочника(Отметка)
	
	Для Каждого Элт Из Объект.ДоступныеРеквизиты Цикл
		Элт.Использовать = Отметка;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(ОшибкиЗаписи)
	
	ТЗ_РеквизитыОбъектаМетаданных = РеквизитФормыВЗначение("РеквизитыОбъектаМетаданных");
	МассивСтрок = ТЗ_РеквизитыОбъектаМетаданных.НайтиСтроки(Новый Структура("ЭлтИзменен", Истина));	
	
	МассивОшибокЗаписи = Новый Массив;
	
	Для Каждого Элт Из МассивСтрок Цикл
		Попытка
			Об = Элт.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(Об,Элт);
			Об.Записать();
		Исключение
			// Аккумулируем сообщение об ошибке.
			ОшибкиЗаписи = ОшибкиЗаписи + "
							| ошибка при записи элемента справочника " + Строка(Элт.Ссылка) + ";";
			МассивОшибокЗаписи.Добавить(Элт);
			Продолжить;
		КонецПопытки
	КонецЦикла;
	
	// Перечитываем результаты записи с базы.
	ЗаполнитьРеквизитыОбъектаМетаданныхСервер();
	
	// Возвращяем изменения не записавшихся в базу элементов.
	Для Каждого Элт Из МассивОшибокЗаписи Цикл
		Замена = РеквизитыОбъектаМетаданных.НайтиСтроки(Новый Структура("Ссылка", Элт.Ссылка));
		Если Замена.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Замена[0], Элт);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавить элемент компоновки в контейнер элементов компоновки.
//
// Параметры:
//  ОбластьДобавления - контейнер с элементами и группами отбора, например Список.Отбор или группа в отборе,
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда),
//  ПравоеЗначение          - произвольный - сравниваемое значение,
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения,
//  Представление           - Строка - представление элемента компоновки данных,
//  Использование           - Булево - использование элемента,
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения,
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
//
&НаСервереБезКонтекста
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено,
									знач ИдентификаторПользовательскойНастройки = Неопределено)
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	// Важно: установка идентификатора должна выполняться
	// в конце настройки элемента, иначе он будет скопирован
	// в пользовательские настройки частично заполненным.
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

&НаСервере
Процедура ОтменитьДляВыбранныхСервер()
	
	СписокЭлтов = Новый Массив;
	ВыделенныеСтроки = Элементы.РеквизитыОбъектаМетаданных.ВыделенныеСтроки;
	Для Каждого Стр Из ВыделенныеСтроки Цикл
		СписокЭлтов.Добавить(РеквизитыОбъектаМетаданных.НайтиПоИдентификатору(Стр).Ссылка);
	КонецЦикла;
	
	ТЗ_Обновления = ПолучитьРеквизитыОбъектаМетаданных(СписокЭлтов);
	
	Для Каждого Элт Из ТЗ_Обновления Цикл
		Замена = РеквизитыОбъектаМетаданных.НайтиСтроки(Новый Структура("Ссылка", Элт.Ссылка));
		Если Замена.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Замена[0], Элт);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция считывает в табличный документ данные из файла в формате Excel.
//
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент, в который необходимо прочитать данные,
//  ИмяФайла           - имя файла в формате Excel, из которого необходимо прочитать данные,
//  НомерЛистаExcel    - номер листа книги Excel, из которого необходимо прочитать данные.
//
// Возвращаемое значение:
//  Истина, если файл прочитан, Ложь - иначе.
//
&НаКлиенте
Функция ПрочитатьТабличныйДокументИзExcel(ТабличныйДокумент, ИмяФайла, НомерЛистаExcel = 1) Экспорт
	
	ФайлЧтения = ИмяФайла;
	НомерСтраницы = НомерЛистаExcel;
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ТекстСообщения = НСтр("ru = 'Файл загрузки не выбран!'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		НомерСтраницы = мКэшНомерСтраницы;
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка. Возможно неверно указан номер листа книги Excel.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		НомерСтраницы = мКэшНомерСтраницы;
		Возврат Ложь;
	КонецПопытки;
	
	ОчиститьТабличныйДокумент(ТабличныйДокумент);
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	
	Для Column = 1 По ColumnCount Цикл
		ТабличныйДокумент.Область("C" + Формат(Column, "ЧГ=")).ШиринаКолонки = ExcelЛист.Columns(Column).ColumnWidth;
	КонецЦикла;
	
	Для Row = 1 По RowCount Цикл
		Для Column = 1 По ColumnCount Цикл
			ТабличныйДокумент.Область("R" + Формат(Row, "ЧГ=") +"C" + Формат(Column, "ЧГ=")).Текст = ExcelЛист.Cells(Row,Column).Text;
		КонецЦикла;
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	мКэшНомерСтраницы = НомерЛистаExcel;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьТабличныйДокумент(ТабличныйДокумент) 

	ТабличныйДокумент.Очистить();
	
КонецПроцедуры

// Процедура формирует структуру колонок загружаемых реквизитов из табличной части "ТаблицаЗагружаемыхРеквизитов".
&НаСервере
Процедура СформироватьСтруктуруКолонок()
	
	ТЗЗагружаемыхРеквизитов = РеквизитФормыВЗначение("ТаблицаЗагружаемыхРеквизитов");
	НомерКолонки = 1;
	Колонки = Новый Структура;
	Для Каждого ЗагружаемыйРеквизит Из ТЗЗагружаемыхРеквизитов Цикл
		
		Если НЕ ЗагружаемыйРеквизит.Пометка Тогда
			Продолжить;	
		КонецЕсли;
		
		Колонка = Новый Структура;
		
		Для каждого КолонкаЗагружаемыхРеквизитов Из ТЗЗагружаемыхРеквизитов.Колонки Цикл
			Колонка.Вставить(КолонкаЗагружаемыхРеквизитов.Имя,ЗагружаемыйРеквизит[КолонкаЗагружаемыхРеквизитов.Имя]);
		КонецЦикла;
		
		Колонки.Вставить(Колонка.ИмяРеквизита,Колонка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ОшибкиЗаписи) // Нужна оптимизация.
	
	СформироватьСтруктуруКолонок();
	КоличествоЭлементов = ТабДок.ВысотаТаблицы - ПерваяСтрокаДанных + 1;
	СтрокиПоиска = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("ПолеПоиска, Пометка", Истина, Истина));
	
	// Нужна объектная модель, убрать из цикла.
	Если Справочник = "бит_Квартиры" Тогда // Заполняется только через лицевые счета.
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|Справочник.Ссылка КАК ЛС,
		|Справочник.Квартира КАК Ссылка
		|ИЗ Справочник.бит_ЛицевыеСчета КАК Справочник
		|ГДЕ";
	ИначеЕсли Справочник = "бит_ЛицевыеСчетаКР" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|Справочник.Ссылка КАК Ссылка
		|ИЗ Справочник.бит_ЛицевыеСчета КАК Справочник
		|ГДЕ";
	Иначе	
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|Справочник.Ссылка КАК Ссылка
		|ИЗ Справочник." + Справочник + " КАК Справочник
		|ГДЕ";
	КонецЕсли;
	
	Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
		ТекстЗапроса = ТекстЗапроса +"
		|Справочник." + СтрокаПоиска.ИмяРеквизита + " = &" + СтрокаПоиска.ИмяРеквизита + "
		|И";
	КонецЦикла;
	
	ТекстЗапроса = Лев(ТекстЗапроса,СтрДлина(ТекстЗапроса) - 2);
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Индикатор = 0;
	Элементы.Индикатор.МаксимальноеЗначение = КоличествоЭлементов;
	Загружено = 0;
	МассивОбработки = Новый Массив;
	
	Для К = ПерваяСтрокаДанных По ТабДок.ВысотаТаблицы Цикл
		НомерТекущейСтроки = Индикатор + 1;
		ТекстыЯчеек = Неопределено;
		Отказ = Ложь;
		ТекущаяСтрока = КонтрольЗаполненияСтроки(ТабДок, К, ТекстыЯчеек);
			
		ОбъектЗаполнения = Неопределено;
		
		Индикатор = Индикатор + 1;
		
		Если НЕ Запрос = Неопределено Тогда
			СтрокаОшибок = "";
			Для каждого СтрокаПоиска Из СтрокиПоиска Цикл
				
				ЗначениеРеквизита = Неопределено;
				
				ТекущаяСтрока.Свойство(СтрокаПоиска.ИмяРеквизита,ЗначениеРеквизита);
				Если ПустаяСтрока(ЗначениеРеквизита) Тогда
					СтрокаОшибок = ?(ПустаяСтрока(СтрокаОшибок),"",СтрокаОшибок + ", ") + СтрокаПоиска.ПредставлениеРеквизита;
				Иначе
					Если Справочник = "бит_ЛицевыеСчетаКР" И СтрокаПоиска.ИмяРеквизита = "Наименование" Тогда
						ПараметрПоиска = ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита];
						ПараметрПоиска = Прав(СокрЛП(ПараметрПоиска), СтрДлина(СокрЛП(ПараметрПоиска)) - 2);
						Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита,ПараметрПоиска);
					Иначе
						Запрос.УстановитьПараметр(СтрокаПоиска.ИмяРеквизита,ТекущаяСтрока[СтрокаПоиска.ИмяРеквизита]);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ПустаяСтрока(СтрокаОшибок) Тогда
				ТекстСообщения = НСтр("ru = 'Строка " + НомерТекущейСтроки + " не может быть записана.Не указано значение ключевых реквизитов: " + СтрокаОшибок + "'");
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
				Индикатор = Индикатор + 1;
				Продолжить;
			КонецЕсли;
			
			Попытка
				Выборка = Запрос.Выполнить().Выбрать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка в настройке загрузки данных.'");
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			КонецПопытки;
			
			Если Выборка.Следующий() Тогда
				
				Если НЕ МассивОбработки.Найти(Выборка.Ссылка) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МассивОбработки.Добавить(Выборка.Ссылка);
				
				ОбъектЗаполнения = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
		КонецЕсли;
		
		ОбъектНайден = Не ОбъектЗаполнения = Неопределено;
		Если ОбъектЗаполнения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого КлючИЗначение Из ТекущаяСтрока Цикл
			
			Если Колонки[КлючИЗначение.Ключ].Пометка И Колонки[КлючИЗначение.Ключ].РежимЗагрузки Тогда
				Попытка
					ОбъектЗаполнения[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				Исключение
					ТекстСообщения = НСтр("ru = 'Ошибка при установки значения реквизита """ + КлючИЗначение.Ключ + "" + ОписаниеОшибки() + "'");
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Отказ и ЗаписатьОбъект(ОбъектЗаполнения, ТекстыЯчеек) Тогда
			ТекстСообщения = НСтр("ru = '" + ?(ОбъектНайден,"Изменен","Загружен") + " элемент справочника: " + ОбъектЗаполнения.Ссылка + "'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			Загружено = Загружено + 1;
		Иначе
			ТекстСообщения = НСтр("ru = 'Объект не " + ?(ОбъектНайден,"изменен","загружен") + ". Элемент справочника: " + ОбъектЗаполнения + ".'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли;
		
		Индикатор = Индикатор + 1;
		
	КонецЦикла;
	МассивОбработки = Неопределено;
	
КонецПроцедуры 

&НаСервере
Функция ЗаписатьОбъект(Объект, ТекстыЯчеек = Неопределено)
	
	НачатьТранзакцию();
	
	Попытка
		Объект.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = '%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция КонтрольЗаполненияСтроки(ТабДок, НомерСтроки, ТекстыЯчеек = Неопределено, КоличествоОшибок = 0)
	
	ТекстыЯчеек = Новый Массив;
	ТекстыЯчеек.Добавить(Неопределено);
	Для к = 1 По ТабДок.ШиринаТаблицы Цикл
		ТекстыЯчеек.Добавить(СокрЛП(ТабДок.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(К,"ЧГ=")).Текст));
	КонецЦикла;
	
	ТекущаяСтрока     = Новый Структура;
	Для каждого КлючИЗначение Из Колонки Цикл
		
		Колонка = КлючИЗначение.Значение;
		
		Если (Колонка.РежимЗагрузки 
			ИЛИ Колонка.ПолеПоиска)
			И НЕ Колонка.НомерКолонки = 0 Тогда
			
			Если Не ОбработатьОбласть(ТабДок.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(Колонка.НомерКолонки,"ЧГ=")), Колонка, ТекущаяСтрока, ТекстыЯчеек) Тогда
				КоличествоОшибок = КоличествоОшибок + 1;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ТекущаяСтрока;
	
КонецФункции

// Процедура выполняет обработку области табличного документа,
// заполняет расшифровку по представлению ячейки в соответствии со структурой загружаемых реквизитов,
// сообщает об ошибке и устанавливает коментарий, если ячейка содержит ошибку.
//
// Параметры:
//  Область - область табличного документа,
//  Колонка - Структура, свойства, в соответствии с которыми необходимо выполнить обработку области,
//  ТекущиеДанные  - структура загруженных значений,
//  ТекстыЯчеек    - массив текстов ячеек строки.
//
&НаСервере
Функция ОбработатьОбласть(Область, Колонка, ТекущиеДанные, ТекстыЯчеек)
	
	Представление = Область.Текст;
	Примечание = "";
	
	Если ПустаяСтрока(Представление) Тогда
		Результат = Неопределено;
	Иначе
		Результат = область.Текст;
	КонецЕсли;
	
	ТекущиеДанные.Вставить(Колонка.ИмяРеквизита,Результат);
	Если Не ПустаяСтрока(Примечание) Тогда
		ТекстСообщения = НСтр("ru = 'Ячейка["+Область.Имя+"]("+Колонка.ПредставлениеРеквизита+"): " + Примечание + "'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	КонецЕсли;
	
	Возврат ПустаяСтрока(Примечание);
	
КонецФункции

// Определяем структуру исключений (не подлежат заполнению).
// Ключ - имя справочника.
// Значение - структура имён реквизитов.
мСтруктураИсключений = Новый Структура();
мСтруктураИсключений.Вставить("бит_СписокЗданий"			, Новый Структура("Организация,НомерДома,Корпус,ПрефиксДома,Район,ТипУправляющейОрганизации,ТипЖилФонда
																				|,Улица,Участок,ВидБлагоустройстваЗданий,Строение,ИмеетТСЖ,ПочтовыйАдрес,ПочтовыйАдресАдрес
																				|,ПочтовыйАдресЗапятые,ПаспортнаяСлужба,МатериалКровли,КонструкцияСтен,БанковскийСчетКапРемонт,ФондКапРемонта
																				|,УборочнаяПлощадьПомещенийВходящихВСоставОбщегоИмуществаВМногоквартирномДоме"));
мСтруктураИсключений.Вставить("бит_ЛицевыеСчета"			, Новый Структура("Организация,Здание,Квартира,УлицаЛицевогоСчета,Идентификатор,КодПоГУГЦЖС,ЛогинДоступа,ОтображатьПоГруппам"));
мСтруктураИсключений.Вставить("бит_Квартиры"				, Новый Структура("НомерКвартиры,ПрефиксКвартиры,НомерПодъезда"));
мСтруктураИсключений.Вставить("бит_Комнаты"					, Новый Структура("НомерКомнаты,ЧастьПомещения,ШаблонКвартир"));
мСтруктураИсключений.Вставить("бит_Счетчики"				, Новый Структура("ВидСчетчика,ТипСчетчика,Объект,Разрядность,НачальныеПоказания,ДатаУстановки,ДатаСнятия
																				|,КоэффициентУмножения,КонечныеПоказания,ДатаПоверки"));
мСтруктураИсключений.Вставить("бит_Проживающие"				, Новый Структура("Комментарий,МестоРождения,ЮрАдресПроживающего,ФактАдресПроживающего,ТелефонПроживающего,ИнформАдресПроживающего
																				|,ИнострАдресПроживающего,ТелефонСлужебныйПроживающего,EmailПроживающего,ДругаяИнформацияПроживающего,АдресПрибытияДрРегион"));
мСтруктураИсключений.Вставить("бит_ПлатежныеДокументыГИСЖКХ", Новый Структура("РасчетныйПериод,ЛицевойСчет,ШаблонИзвещений,Код"));

// Определяем структуру реквизитов справочников для загрузки.
// Ключ - имя справочника.
// Значение - структура имён реквизитов.
мСтруктураРеквизитов = Новый Структура();
мСтруктураРеквизитов.Вставить("бит_ЛицевыеСчета"			, Новый Структура("ЕЛСГИСЖКХ, ИдентификаторЖКУ"));
мСтруктураРеквизитов.Вставить("бит_ЛицевыеСчетаКР"			, Новый Структура("КапРемЕЛСГИСЖКХ, КапРемИдентификаторЖКУ"));
мСтруктураРеквизитов.Вставить("бит_СписокЗданий"			, Новый Структура(""));
мСтруктураРеквизитов.Вставить("бит_Квартиры"				, Новый Структура("УникальныйНомерГИСЖКХ, КадастровыйНомер"));
мСтруктураРеквизитов.Вставить("бит_Комнаты"					, Новый Структура(""));
мСтруктураРеквизитов.Вставить("бит_Счетчики"				, Новый Структура("УникальныйНомерГИСЖКХ"));
мСтруктураРеквизитов.Вставить("бит_ПлатежныеДокументыГИСЖКХ", Новый Структура("ИдентификаторПД"));

#КонецОбласти
